# Assigment 2

In [1]:
import pandas as pd
import sqlite3

In [2]:
try:
    connection=sqlite3.connect('lahman2014.sqlite')
except Error as e:
    print(e)

In [3]:
teamPandas=pd.read_sql_query("""SELECT yearID,teamID,Rank,G,W,name FROM Teams""",connection)
teamPandas.head()

   yearID teamID  Rank   G   W                     name
0    1871    BS1     3  31  20     Boston Red Stockings
1    1871    CH1     2  28  19  Chicago White Stockings
2    1871    CL1     8  29  10   Cleveland Forest Citys
3    1871    FW1     7  19   7     Fort Wayne Kekiongas
4    1871    NY2     5  33  16         New York Mutuals

In [4]:
salaryPandas=pd.read_sql_query("""SELECT * FROM Salaries""",connection)
salaryPandas.head()

   yearID teamID lgID   playerID    salary
0    1985    ATL   NL  barkele01  870000.0
1    1985    ATL   NL  bedrost01  550000.0
2    1985    ATL   NL  benedbr01  545000.0
3    1985    ATL   NL   campri01  633333.0
4    1985    ATL   NL  ceronri01  625000.0

In [5]:
dictionaryOfTeams={}
for i in teamPandas.itertuples():
    if i[2] not in dictionaryOfTeams:
        #2 for teamId
        #4 for gamePlay
        #5 for wining
        dictionaryOfTeams[i[2]]=[i[4],i[5],0]
    else:
        dictionaryOfTeams[i[2]][0]+=i[4]
        dictionaryOfTeams[i[2]][1]+=i[5]
#For loop to add all salaries to leagueTeams
for i in salaryPandas.itertuples():
    if i[2] not in dictionaryOfTeams:
        continue
    dictionaryOfTeams[i[2]][2]+=i[5]

In [6]:
len(dictionaryOfTeams)

149

In [7]:
Teams=pd.DataFrame.from_dict(dictionaryOfTeams, orient='index',columns=['Playing', 'Winning','Total payRolls in million'])

In [8]:
Teams['Total payRolls in million'] = Teams['Total payRolls in million'].astype(float)
Teams['Total payRolls in million']/=1000000

In [9]:
Teams['WinRate']=Teams.Winning/Teams.Playing

In [10]:
Teams.head()

     Playing  Winning  Total payRolls in million   WinRate
BS1      292      225                        0.0  0.770548
CH1       28       19                        0.0  0.678571
CL1       51       16                        0.0  0.313725
FW1       19        7                        0.0  0.368421
NY2      278      151                        0.0  0.543165

In [11]:
#those teams have different names in teamDataBase 
notFoundTeams=[]
for i in salaryPandas.itertuples():
     if i[2] not in dictionaryOfTeams and i[2]not in notFoundTeams:
            notFoundTeams.append(i[2])
notFoundTeams

['NYM', 'SFG']